Revit 2024 API
IFCData.PrimitiveType Property
 The primitive data type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IFCDataPrimitiveType PrimitiveType { get; set; }
Visual Basic
Public Property PrimitiveType As IFCDataPrimitiveType
	Get
	Set
Visual C++
public:
property IFCDataPrimitiveType PrimitiveType {
	IFCDataPrimitiveType get ();
	void set (IFCDataPrimitiveType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace